Revit 2027 API
SolidCurveIntersection.GetCurveSegmentExtents Method
 Gets the extents for the given curve segment generated by intersection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CurveExtents GetCurveSegmentExtents(
	int index
)
Public Function GetCurveSegmentExtents (
	index As Integer
) As CurveExtents
public:
CurveExtents^ GetCurveSegmentExtents(
	int index
)
member GetCurveSegmentExtents :
        index : int -> CurveExtents
Parameters
index Int32
 The index.
Return Value
CurveExtents
 The curve extents.
Exceptions
Exception | Condition
ArgumentException |  index is out of range.
Remarks
 The parameters are raw parameters based on the raw parameter extents of the original input curve.
See Also
Reference
SolidCurveIntersection Class
Autodesk.Revit.DB Namespace